---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterElement
source: html/51c6a26c-915f-c1a5-ad04-05247c44a198.htm
---
# ParameterElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.